dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 2B2, Read Data and Bit Flip Register 41 */
#define MTU_MC2_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B2u)

/** \brief 2B4, Read Data and Bit Flip Register 42 */
#define MTU_MC2_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B4u)

/** \brief 2B6, Read Data and Bit Flip Register 43 */
#define MTU_MC2_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B6u)

/** \brief 2B8, Read Data and Bit Flip Register 44 */
#define MTU_MC2_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B8u)

/** \brief 2BA, Read Data and Bit Flip Register 45 */
#define MTU_MC2_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BAu)

/** \brief 2BC, Read Data and Bit Flip Register 46 */
#define MTU_MC2_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BCu)

/** \brief 2BE, Read Data and Bit Flip Register 47 */
#define MTU_MC2_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BEu)

/** \brief 2C0, Read Data and Bit Flip Register 48 */
#define MTU_MC2_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C0u)

/** \brief 2C2, Read Data and Bit Flip Register 49 */
#define MTU_MC2_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C2u)

/** \brief 2C4, Read Data and Bit Flip Register 50 */
#define MTU_MC2_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C4u)

/** \brief 2C6, Read Data and Bit Flip Register 51 */
#define MTU_MC2_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C6u)

/** \brief 2C8, Read Data and Bit Flip Register 52 */
#define MTU_MC2_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C8u)

/** \brief 2CA, Read Data and Bit Flip Register 53 */
#define MTU_MC2_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CAu)

/** \brief 2CC, Read Data and Bit Flip Register 54 */
#define MTU_MC2_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CCu)

/** \brief 2CE, Read Data and Bit Flip Register 55 */
#define MTU_MC2_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CEu)

/** \brief 2D0, Read Data and Bit Flip Register 56 */
#define MTU_MC2_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D0u)

/** \brief 2D2, Read Data and Bit Flip Register 57 */
#define MTU_MC2_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D2u)

/** \brief 2D4, Read Data and Bit Flip Register 58 */
#define MTU_MC2_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D4u)

/** \brief 2D6, Read Data and Bit Flip Register 59 */
#define MTU_MC2_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D6u)

/** \brief 2D8, Read Data and Bit Flip Register 60 */
#define MTU_MC2_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D8u)

/** \brief 2DA, Read Data and Bit Flip Register 61 */
#define MTU_MC2_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DAu)

/** \brief 2DC, Read Data and Bit Flip Register 62 */
#define MTU_MC2_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DCu)

/** \brief 2DE, Read Data and Bit Flip Register 63 */
#define MTU_MC2_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DEu)

/** \brief 2E0, Read Data and Bit Flip Register 64 */
#define MTU_MC2_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E0u)

/** \brief 2E2, Read Data and Bit Flip Register 65 */
#define MTU_MC2_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E2u)

/** \brief 2E4, Read Data and Bit Flip Register 66 */
#define MTU_MC2_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E4u)

/** \brief 2EE, Alarm Sources Configuration Register */
#define MTU_MC2_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00612EEu)

/** \brief 2F0, SSH Safety Faults Status Register  */
#define MTU_MC2_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00612F0u)

/** \brief 2F2, Error Information Register 0 */
#define MTU_MC2_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F2u)

/** \brief 2F4, Error Information Register 1 */
#define MTU_MC2_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F4u)

/** \brief 2F6, Error Information Register 2 */
#define MTU_MC2_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F6u)

/** \brief 2F8, Error Information Register 3 */
#define MTU_MC2_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F8u)

/** \brief 2FA, Error Information Register 4 */
#define MTU_MC2_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612FAu)

/** \brief 300, Configuration Registers */
#define MTU_MC3_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061300u)

/** \brief 302, Configuration Register 1 */
#define MTU_MC3_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061302u)

/** \brief 304, MBIST Control Register */
#define MTU_MC3_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061304u)

/** \brief 306, Status Register */
#define MTU_MC3_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061306u)

/** \brief 308, Range Register, single address mode */
#define MTU_MC3_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061308u)

/** \brief 30C, Revision ID Register */
#define MTU_MC3_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006130Cu)

/** \brief 30E, ECC Safety Register */
#define MTU_MC3_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006130Eu)

/** \brief 310, Memory ECC Detection Register */
#define MTU_MC3_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061310u)

/** \brief 312, Error Tracking Register 0 */
#define MTU_MC3_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061312u)

/** \brief 314, Error Tracking Register 1 */
#define MTU_MC3_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061314u)

/** \brief 316, Error Tracking Register 2 */
#define MTU_MC3_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061316u)

/** \brief 318, Error Tracking Register 3 */
#define MTU_MC3_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061318u)

/** \brief 31A, Error Tracking Register 4 */
#define MTU_MC3_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006131Au)

/** \brief 360, Read Data and Bit Flip Register 0 */
#define MTU_MC3_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061360u)

