dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 462, Read Data and Bit Flip Register 1 */
#define MTU_MC4_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061462u)

/** \brief 464, Read Data and Bit Flip Register 2 */
#define MTU_MC4_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061464u)

/** \brief 466, Read Data and Bit Flip Register 3 */
#define MTU_MC4_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061466u)

/** \brief 468, Read Data and Bit Flip Register 4 */
#define MTU_MC4_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061468u)

/** \brief 46A, Read Data and Bit Flip Register 5 */
#define MTU_MC4_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Au)

/** \brief 46C, Read Data and Bit Flip Register 6 */
#define MTU_MC4_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Cu)

/** \brief 46E, Read Data and Bit Flip Register 7 */
#define MTU_MC4_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Eu)

/** \brief 470, Read Data and Bit Flip Register 8 */
#define MTU_MC4_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061470u)

/** \brief 472, Read Data and Bit Flip Register 9 */
#define MTU_MC4_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061472u)

/** \brief 474, Read Data and Bit Flip Register 10 */
#define MTU_MC4_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061474u)

/** \brief 476, Read Data and Bit Flip Register 11 */
#define MTU_MC4_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061476u)

/** \brief 478, Read Data and Bit Flip Register 12 */
#define MTU_MC4_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061478u)

/** \brief 47A, Read Data and Bit Flip Register 13 */
#define MTU_MC4_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Au)

/** \brief 47C, Read Data and Bit Flip Register 14 */
#define MTU_MC4_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Cu)

/** \brief 47E, Read Data and Bit Flip Register 15 */
#define MTU_MC4_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Eu)

/** \brief 480, Read Data and Bit Flip Register 16 */
#define MTU_MC4_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061480u)

/** \brief 482, Read Data and Bit Flip Register 17 */
#define MTU_MC4_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061482u)

/** \brief 484, Read Data and Bit Flip Register 18 */
#define MTU_MC4_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061484u)

/** \brief 486, Read Data and Bit Flip Register 19 */
#define MTU_MC4_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061486u)

/** \brief 488, Read Data and Bit Flip Register 20 */
#define MTU_MC4_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061488u)

/** \brief 48A, Read Data and Bit Flip Register 21 */
#define MTU_MC4_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Au)

/** \brief 48C, Read Data and Bit Flip Register 22 */
#define MTU_MC4_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Cu)

/** \brief 48E, Read Data and Bit Flip Register 23 */
#define MTU_MC4_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Eu)

/** \brief 490, Read Data and Bit Flip Register 24 */
#define MTU_MC4_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061490u)

/** \brief 492, Read Data and Bit Flip Register 25 */
#define MTU_MC4_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061492u)

/** \brief 494, Read Data and Bit Flip Register 26 */
#define MTU_MC4_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061494u)

/** \brief 496, Read Data and Bit Flip Register 27 */
#define MTU_MC4_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061496u)

/** \brief 498, Read Data and Bit Flip Register 28 */
#define MTU_MC4_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061498u)

/** \brief 49A, Read Data and Bit Flip Register 29 */
#define MTU_MC4_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Au)

/** \brief 49C, Read Data and Bit Flip Register 30 */
#define MTU_MC4_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Cu)

/** \brief 49E, Read Data and Bit Flip Register 31 */
#define MTU_MC4_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Eu)

/** \brief 4A0, Read Data and Bit Flip Register 32 */
#define MTU_MC4_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A0u)

/** \brief 4A2, Read Data and Bit Flip Register 33 */
#define MTU_MC4_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A2u)

/** \brief 4A4, Read Data and Bit Flip Register 34 */
#define MTU_MC4_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A4u)

/** \brief 4A6, Read Data and Bit Flip Register 35 */
#define MTU_MC4_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A6u)

/** \brief 4A8, Read Data and Bit Flip Register 36 */
#define MTU_MC4_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A8u)

/** \brief 4AA, Read Data and Bit Flip Register 37 */
#define MTU_MC4_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614AAu)

/** \brief 4AC, Read Data and Bit Flip Register 38 */
#define MTU_MC4_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614ACu)

/** \brief 4AE, Read Data and Bit Flip Register 39 */
#define MTU_MC4_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614AEu)

/** \brief 4B0, Read Data and Bit Flip Register 40 */
#define MTU_MC4_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B0u)

/** \brief 4B2, Read Data and Bit Flip Register 41 */
#define MTU_MC4_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B2u)

/** \brief 4B4, Read Data and Bit Flip Register 42 */
#define MTU_MC4_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B4u)

/** \brief 4B6, Read Data and Bit Flip Register 43 */
#define MTU_MC4_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B6u)

