dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 9F2, Error Information Register 0 */
#define MTU_MC9_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F2u)

/** \brief 9F4, Error Information Register 1 */
#define MTU_MC9_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F4u)

/** \brief 9F6, Error Information Register 2 */
#define MTU_MC9_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F6u)

/** \brief 9F8, Error Information Register 3 */
#define MTU_MC9_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F8u)

/** \brief 9FA, Error Information Register 4 */
#define MTU_MC9_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619FAu)

/** \brief A00, Configuration Registers */
#define MTU_MC10_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061A00u)

/** \brief A02, Configuration Register 1 */
#define MTU_MC10_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061A02u)

/** \brief A04, MBIST Control Register */
#define MTU_MC10_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061A04u)

/** \brief A06, Status Register */
#define MTU_MC10_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061A06u)

/** \brief A08, Range Register, single address mode */
#define MTU_MC10_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061A08u)

/** \brief A0C, Revision ID Register */
#define MTU_MC10_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061A0Cu)

/** \brief A0E, ECC Safety Register */
#define MTU_MC10_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061A0Eu)

/** \brief A10, Memory ECC Detection Register */
#define MTU_MC10_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061A10u)

/** \brief A12, Error Tracking Register 0 */
#define MTU_MC10_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A12u)

/** \brief A14, Error Tracking Register 1 */
#define MTU_MC10_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A14u)

/** \brief A16, Error Tracking Register 2 */
#define MTU_MC10_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A16u)

/** \brief A18, Error Tracking Register 3 */
#define MTU_MC10_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A18u)

/** \brief A1A, Error Tracking Register 4 */
#define MTU_MC10_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A1Au)

/** \brief A60, Read Data and Bit Flip Register 0 */
#define MTU_MC10_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A60u)

/** \brief A62, Read Data and Bit Flip Register 1 */
#define MTU_MC10_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A62u)

/** \brief A64, Read Data and Bit Flip Register 2 */
#define MTU_MC10_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A64u)

/** \brief A66, Read Data and Bit Flip Register 3 */
#define MTU_MC10_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A66u)

/** \brief A68, Read Data and Bit Flip Register 4 */
#define MTU_MC10_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A68u)

/** \brief A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC10_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Au)

/** \brief A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC10_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Cu)

/** \brief A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC10_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Eu)

/** \brief A70, Read Data and Bit Flip Register 8 */
#define MTU_MC10_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A70u)

/** \brief A72, Read Data and Bit Flip Register 9 */
#define MTU_MC10_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A72u)

/** \brief A74, Read Data and Bit Flip Register 10 */
#define MTU_MC10_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A74u)

/** \brief A76, Read Data and Bit Flip Register 11 */
#define MTU_MC10_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A76u)

/** \brief A78, Read Data and Bit Flip Register 12 */
#define MTU_MC10_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A78u)

/** \brief A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC10_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Au)

/** \brief A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC10_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Cu)

/** \brief A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC10_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Eu)

/** \brief A80, Read Data and Bit Flip Register 16 */
#define MTU_MC10_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A80u)

/** \brief A82, Read Data and Bit Flip Register 17 */
#define MTU_MC10_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A82u)

/** \brief A84, Read Data and Bit Flip Register 18 */
#define MTU_MC10_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A84u)

/** \brief A86, Read Data and Bit Flip Register 19 */
#define MTU_MC10_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A86u)

/** \brief A88, Read Data and Bit Flip Register 20 */
#define MTU_MC10_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A88u)

/** \brief A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC10_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Au)

/** \brief A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC10_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Cu)

/** \brief A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC10_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Eu)

/** \brief A90, Read Data and Bit Flip Register 24 */
#define MTU_MC10_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A90u)

/** \brief A92, Read Data and Bit Flip Register 25 */
#define MTU_MC10_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A92u)

/** \brief A94, Read Data and Bit Flip Register 26 */
#define MTU_MC10_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A94u)

/** \brief A96, Read Data and Bit Flip Register 27 */
#define MTU_MC10_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A96u)

