dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief F02, Configuration Register 1 */
#define MTU_MC15_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061F02u)

/** \brief F04, MBIST Control Register */
#define MTU_MC15_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061F04u)

/** \brief F06, Status Register */
#define MTU_MC15_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061F06u)

/** \brief F08, Range Register, single address mode */
#define MTU_MC15_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061F08u)

/** \brief F0C, Revision ID Register */
#define MTU_MC15_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061F0Cu)

/** \brief F0E, ECC Safety Register */
#define MTU_MC15_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061F0Eu)

/** \brief F10, Memory ECC Detection Register */
#define MTU_MC15_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061F10u)

/** \brief F12, Error Tracking Register 0 */
#define MTU_MC15_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061F12u)

/** \brief F14, Error Tracking Register 1 */
#define MTU_MC15_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061F14u)

/** \brief F16, Error Tracking Register 2 */
#define MTU_MC15_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061F16u)

/** \brief F18, Error Tracking Register 3 */
#define MTU_MC15_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061F18u)

/** \brief F1A, Error Tracking Register 4 */
#define MTU_MC15_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061F1Au)

/** \brief F60, Read Data and Bit Flip Register 0 */
#define MTU_MC15_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F60u)

/** \brief F62, Read Data and Bit Flip Register 1 */
#define MTU_MC15_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F62u)

/** \brief F64, Read Data and Bit Flip Register 2 */
#define MTU_MC15_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F64u)

/** \brief F66, Read Data and Bit Flip Register 3 */
#define MTU_MC15_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F66u)

/** \brief F68, Read Data and Bit Flip Register 4 */
#define MTU_MC15_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F68u)

/** \brief F6A, Read Data and Bit Flip Register 5 */
#define MTU_MC15_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F6Au)

/** \brief F6C, Read Data and Bit Flip Register 6 */
#define MTU_MC15_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F6Cu)

/** \brief F6E, Read Data and Bit Flip Register 7 */
#define MTU_MC15_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F6Eu)

/** \brief F70, Read Data and Bit Flip Register 8 */
#define MTU_MC15_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F70u)

/** \brief F72, Read Data and Bit Flip Register 9 */
#define MTU_MC15_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F72u)

/** \brief F74, Read Data and Bit Flip Register 10 */
#define MTU_MC15_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F74u)

/** \brief F76, Read Data and Bit Flip Register 11 */
#define MTU_MC15_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F76u)

/** \brief F78, Read Data and Bit Flip Register 12 */
#define MTU_MC15_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F78u)

/** \brief F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC15_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F7Au)

/** \brief F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC15_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F7Cu)

/** \brief F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC15_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F7Eu)

/** \brief F80, Read Data and Bit Flip Register 16 */
#define MTU_MC15_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F80u)

/** \brief F82, Read Data and Bit Flip Register 17 */
#define MTU_MC15_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F82u)

/** \brief F84, Read Data and Bit Flip Register 18 */
#define MTU_MC15_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F84u)

/** \brief F86, Read Data and Bit Flip Register 19 */
#define MTU_MC15_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F86u)

/** \brief F88, Read Data and Bit Flip Register 20 */
#define MTU_MC15_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F88u)

/** \brief F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC15_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F8Au)

/** \brief F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC15_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F8Cu)

/** \brief F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC15_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F8Eu)

/** \brief F90, Read Data and Bit Flip Register 24 */
#define MTU_MC15_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F90u)

/** \brief F92, Read Data and Bit Flip Register 25 */
#define MTU_MC15_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F92u)

/** \brief F94, Read Data and Bit Flip Register 26 */
#define MTU_MC15_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F94u)

/** \brief F96, Read Data and Bit Flip Register 27 */
#define MTU_MC15_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F96u)

/** \brief F98, Read Data and Bit Flip Register 28 */
#define MTU_MC15_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F98u)

/** \brief F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC15_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Au)

/** \brief F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC15_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Cu)

