dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 1698, Read Data and Bit Flip Register 28 */
#define MTU_MC22_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062698u)

/** \brief 169A, Read Data and Bit Flip Register 29 */
#define MTU_MC22_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Au)

/** \brief 169C, Read Data and Bit Flip Register 30 */
#define MTU_MC22_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Cu)

/** \brief 169E, Read Data and Bit Flip Register 31 */
#define MTU_MC22_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Eu)

/** \brief 16A0, Read Data and Bit Flip Register 32 */
#define MTU_MC22_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A0u)

/** \brief 16A2, Read Data and Bit Flip Register 33 */
#define MTU_MC22_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A2u)

/** \brief 16A4, Read Data and Bit Flip Register 34 */
#define MTU_MC22_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A4u)

/** \brief 16A6, Read Data and Bit Flip Register 35 */
#define MTU_MC22_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A6u)

/** \brief 16A8, Read Data and Bit Flip Register 36 */
#define MTU_MC22_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A8u)

/** \brief 16AA, Read Data and Bit Flip Register 37 */
#define MTU_MC22_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626AAu)

/** \brief 16AC, Read Data and Bit Flip Register 38 */
#define MTU_MC22_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626ACu)

/** \brief 16AE, Read Data and Bit Flip Register 39 */
#define MTU_MC22_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626AEu)

/** \brief 16B0, Read Data and Bit Flip Register 40 */
#define MTU_MC22_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B0u)

/** \brief 16B2, Read Data and Bit Flip Register 41 */
#define MTU_MC22_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B2u)

/** \brief 16B4, Read Data and Bit Flip Register 42 */
#define MTU_MC22_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B4u)

/** \brief 16B6, Read Data and Bit Flip Register 43 */
#define MTU_MC22_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B6u)

/** \brief 16B8, Read Data and Bit Flip Register 44 */
#define MTU_MC22_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B8u)

/** \brief 16BA, Read Data and Bit Flip Register 45 */
#define MTU_MC22_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BAu)

/** \brief 16BC, Read Data and Bit Flip Register 46 */
#define MTU_MC22_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BCu)

/** \brief 16BE, Read Data and Bit Flip Register 47 */
#define MTU_MC22_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BEu)

/** \brief 16C0, Read Data and Bit Flip Register 48 */
#define MTU_MC22_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C0u)

/** \brief 16C2, Read Data and Bit Flip Register 49 */
#define MTU_MC22_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C2u)

/** \brief 16C4, Read Data and Bit Flip Register 50 */
#define MTU_MC22_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C4u)

/** \brief 16C6, Read Data and Bit Flip Register 51 */
#define MTU_MC22_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C6u)

/** \brief 16C8, Read Data and Bit Flip Register 52 */
#define MTU_MC22_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C8u)

/** \brief 16CA, Read Data and Bit Flip Register 53 */
#define MTU_MC22_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CAu)

/** \brief 16CC, Read Data and Bit Flip Register 54 */
#define MTU_MC22_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CCu)

/** \brief 16CE, Read Data and Bit Flip Register 55 */
#define MTU_MC22_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CEu)

/** \brief 16D0, Read Data and Bit Flip Register 56 */
#define MTU_MC22_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D0u)

/** \brief 16D2, Read Data and Bit Flip Register 57 */
#define MTU_MC22_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D2u)

/** \brief 16D4, Read Data and Bit Flip Register 58 */
#define MTU_MC22_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D4u)

/** \brief 16D6, Read Data and Bit Flip Register 59 */
#define MTU_MC22_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D6u)

/** \brief 16D8, Read Data and Bit Flip Register 60 */
#define MTU_MC22_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D8u)

/** \brief 16DA, Read Data and Bit Flip Register 61 */
#define MTU_MC22_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DAu)

/** \brief 16DC, Read Data and Bit Flip Register 62 */
#define MTU_MC22_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DCu)

/** \brief 16DE, Read Data and Bit Flip Register 63 */
#define MTU_MC22_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DEu)

/** \brief 16E0, Read Data and Bit Flip Register 64 */
#define MTU_MC22_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E0u)

/** \brief 16E2, Read Data and Bit Flip Register 65 */
#define MTU_MC22_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E2u)

/** \brief 16E4, Read Data and Bit Flip Register 66 */
#define MTU_MC22_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E4u)

/** \brief 16EE, Alarm Sources Configuration Register */
#define MTU_MC22_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00626EEu)

/** \brief 16F0, SSH Safety Faults Status Register  */
#define MTU_MC22_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00626F0u)

