dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 189C, Read Data and Bit Flip Register 30 */
#define MTU_MC24_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006289Cu)

/** \brief 189E, Read Data and Bit Flip Register 31 */
#define MTU_MC24_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006289Eu)

/** \brief 18A0, Read Data and Bit Flip Register 32 */
#define MTU_MC24_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A0u)

/** \brief 18A2, Read Data and Bit Flip Register 33 */
#define MTU_MC24_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A2u)

/** \brief 18A4, Read Data and Bit Flip Register 34 */
#define MTU_MC24_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A4u)

/** \brief 18A6, Read Data and Bit Flip Register 35 */
#define MTU_MC24_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A6u)

/** \brief 18A8, Read Data and Bit Flip Register 36 */
#define MTU_MC24_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A8u)

/** \brief 18AA, Read Data and Bit Flip Register 37 */
#define MTU_MC24_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628AAu)

/** \brief 18AC, Read Data and Bit Flip Register 38 */
#define MTU_MC24_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628ACu)

/** \brief 18AE, Read Data and Bit Flip Register 39 */
#define MTU_MC24_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628AEu)

/** \brief 18B0, Read Data and Bit Flip Register 40 */
#define MTU_MC24_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B0u)

/** \brief 18B2, Read Data and Bit Flip Register 41 */
#define MTU_MC24_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B2u)

/** \brief 18B4, Read Data and Bit Flip Register 42 */
#define MTU_MC24_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B4u)

/** \brief 18B6, Read Data and Bit Flip Register 43 */
#define MTU_MC24_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B6u)

/** \brief 18B8, Read Data and Bit Flip Register 44 */
#define MTU_MC24_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B8u)

/** \brief 18BA, Read Data and Bit Flip Register 45 */
#define MTU_MC24_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BAu)

/** \brief 18BC, Read Data and Bit Flip Register 46 */
#define MTU_MC24_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BCu)

/** \brief 18BE, Read Data and Bit Flip Register 47 */
#define MTU_MC24_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BEu)

/** \brief 18C0, Read Data and Bit Flip Register 48 */
#define MTU_MC24_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C0u)

/** \brief 18C2, Read Data and Bit Flip Register 49 */
#define MTU_MC24_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C2u)

/** \brief 18C4, Read Data and Bit Flip Register 50 */
#define MTU_MC24_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C4u)

/** \brief 18C6, Read Data and Bit Flip Register 51 */
#define MTU_MC24_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C6u)

/** \brief 18C8, Read Data and Bit Flip Register 52 */
#define MTU_MC24_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C8u)

/** \brief 18CA, Read Data and Bit Flip Register 53 */
#define MTU_MC24_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CAu)

/** \brief 18CC, Read Data and Bit Flip Register 54 */
#define MTU_MC24_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CCu)

/** \brief 18CE, Read Data and Bit Flip Register 55 */
#define MTU_MC24_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CEu)

/** \brief 18D0, Read Data and Bit Flip Register 56 */
#define MTU_MC24_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D0u)

/** \brief 18D2, Read Data and Bit Flip Register 57 */
#define MTU_MC24_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D2u)

/** \brief 18D4, Read Data and Bit Flip Register 58 */
#define MTU_MC24_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D4u)

/** \brief 18D6, Read Data and Bit Flip Register 59 */
#define MTU_MC24_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D6u)

/** \brief 18D8, Read Data and Bit Flip Register 60 */
#define MTU_MC24_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D8u)

/** \brief 18DA, Read Data and Bit Flip Register 61 */
#define MTU_MC24_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DAu)

/** \brief 18DC, Read Data and Bit Flip Register 62 */
#define MTU_MC24_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DCu)

/** \brief 18DE, Read Data and Bit Flip Register 63 */
#define MTU_MC24_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DEu)

/** \brief 18E0, Read Data and Bit Flip Register 64 */
#define MTU_MC24_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E0u)

/** \brief 18E2, Read Data and Bit Flip Register 65 */
#define MTU_MC24_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E2u)

/** \brief 18E4, Read Data and Bit Flip Register 66 */
#define MTU_MC24_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E4u)

/** \brief 18EE, Alarm Sources Configuration Register */
#define MTU_MC24_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00628EEu)

/** \brief 18F0, SSH Safety Faults Status Register  */
#define MTU_MC24_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00628F0u)

/** \brief 18F2, Error Information Register 0 */
#define MTU_MC24_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F2u)

/** \brief 18F4, Error Information Register 1 */
#define MTU_MC24_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F4u)

/** \brief 18F6, Error Information Register 2 */
#define MTU_MC24_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F6u)

/** \brief 18F8, Error Information Register 3 */
#define MTU_MC24_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F8u)

/** \brief 18FA, Error Information Register 4 */
#define MTU_MC24_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628FAu)

/** \brief 1900, Configuration Registers */
#define MTU_MC25_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062900u)

/** \brief 1902, Configuration Register 1 */
#define MTU_MC25_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062902u)

/** \brief 1904, MBIST Control Register */
#define MTU_MC25_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062904u)

/** \brief 1906, Status Register */
#define MTU_MC25_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062906u)

/** \brief 1908, Range Register, single address mode */
#define MTU_MC25_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062908u)

/** \brief 190C, Revision ID Register */
#define MTU_MC25_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006290Cu)

/** \brief 190E, ECC Safety Register */
#define MTU_MC25_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006290Eu)

/** \brief 1910, Memory ECC Detection Register */
#define MTU_MC25_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062910u)

/** \brief 1912, Error Tracking Register 0 */
#define MTU_MC25_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062912u)

/** \brief 1914, Error Tracking Register 1 */
#define MTU_MC25_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062914u)

/** \brief 1916, Error Tracking Register 2 */
#define MTU_MC25_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062916u)

/** \brief 1918, Error Tracking Register 3 */
#define MTU_MC25_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062918u)

/** \brief 191A, Error Tracking Register 4 */
#define MTU_MC25_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006291Au)

/** \brief 1960, Read Data and Bit Flip Register 0 */
#define MTU_MC25_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062960u)

/** \brief 1962, Read Data and Bit Flip Register 1 */
#define MTU_MC25_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062962u)

/** \brief 1964, Read Data and Bit Flip Register 2 */
#define MTU_MC25_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062964u)

