dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 1FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC31_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBCu)

/** \brief 1FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC31_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBEu)

/** \brief 1FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC31_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC0u)

/** \brief 1FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC31_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC2u)

/** \brief 1FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC31_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC4u)

/** \brief 1FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC31_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC6u)

/** \brief 1FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC31_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC8u)

/** \brief 1FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC31_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCAu)

/** \brief 1FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC31_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCCu)

/** \brief 1FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC31_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCEu)

/** \brief 1FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC31_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD0u)

/** \brief 1FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC31_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD2u)

/** \brief 1FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC31_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD4u)

/** \brief 1FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC31_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD6u)

/** \brief 1FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC31_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD8u)

/** \brief 1FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC31_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDAu)

/** \brief 1FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC31_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDCu)

/** \brief 1FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC31_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDEu)

/** \brief 1FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC31_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE0u)

/** \brief 1FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC31_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE2u)

/** \brief 1FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC31_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE4u)

/** \brief 1FEE, Alarm Sources Configuration Register */
#define MTU_MC31_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0062FEEu)

/** \brief 1FF0, SSH Safety Faults Status Register  */
#define MTU_MC31_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0062FF0u)

/** \brief 1FF2, Error Information Register 0 */
#define MTU_MC31_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF2u)

/** \brief 1FF4, Error Information Register 1 */
#define MTU_MC31_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF4u)

/** \brief 1FF6, Error Information Register 2 */
#define MTU_MC31_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF6u)

/** \brief 1FF8, Error Information Register 3 */
#define MTU_MC31_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF8u)

/** \brief 1FFA, Error Information Register 4 */
#define MTU_MC31_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FFAu)

/** \brief 2000, Configuration Registers */
#define MTU_MC32_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063000u)

/** \brief 2002, Configuration Register 1 */
#define MTU_MC32_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063002u)

/** \brief 2004, MBIST Control Register */
#define MTU_MC32_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063004u)

/** \brief 2006, Status Register */
#define MTU_MC32_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063006u)

/** \brief 2008, Range Register, single address mode */
#define MTU_MC32_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063008u)

/** \brief 200C, Revision ID Register */
#define MTU_MC32_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006300Cu)

/** \brief 200E, ECC Safety Register */
#define MTU_MC32_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006300Eu)

/** \brief 2010, Memory ECC Detection Register */
#define MTU_MC32_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063010u)

/** \brief 2012, Error Tracking Register 0 */
#define MTU_MC32_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063012u)

/** \brief 2014, Error Tracking Register 1 */
#define MTU_MC32_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063014u)

/** \brief 2016, Error Tracking Register 2 */
#define MTU_MC32_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063016u)

/** \brief 2018, Error Tracking Register 3 */
#define MTU_MC32_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063018u)

/** \brief 201A, Error Tracking Register 4 */
#define MTU_MC32_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006301Au)

/** \brief 2060, Read Data and Bit Flip Register 0 */
#define MTU_MC32_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063060u)

