dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 22AE, Read Data and Bit Flip Register 39 */
#define MTU_MC34_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632AEu)

/** \brief 22B0, Read Data and Bit Flip Register 40 */
#define MTU_MC34_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B0u)

/** \brief 22B2, Read Data and Bit Flip Register 41 */
#define MTU_MC34_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B2u)

/** \brief 22B4, Read Data and Bit Flip Register 42 */
#define MTU_MC34_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B4u)

/** \brief 22B6, Read Data and Bit Flip Register 43 */
#define MTU_MC34_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B6u)

/** \brief 22B8, Read Data and Bit Flip Register 44 */
#define MTU_MC34_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B8u)

/** \brief 22BA, Read Data and Bit Flip Register 45 */
#define MTU_MC34_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BAu)

/** \brief 22BC, Read Data and Bit Flip Register 46 */
#define MTU_MC34_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BCu)

/** \brief 22BE, Read Data and Bit Flip Register 47 */
#define MTU_MC34_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BEu)

/** \brief 22C0, Read Data and Bit Flip Register 48 */
#define MTU_MC34_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C0u)

/** \brief 22C2, Read Data and Bit Flip Register 49 */
#define MTU_MC34_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C2u)

/** \brief 22C4, Read Data and Bit Flip Register 50 */
#define MTU_MC34_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C4u)

/** \brief 22C6, Read Data and Bit Flip Register 51 */
#define MTU_MC34_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C6u)

/** \brief 22C8, Read Data and Bit Flip Register 52 */
#define MTU_MC34_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C8u)

/** \brief 22CA, Read Data and Bit Flip Register 53 */
#define MTU_MC34_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CAu)

/** \brief 22CC, Read Data and Bit Flip Register 54 */
#define MTU_MC34_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CCu)

/** \brief 22CE, Read Data and Bit Flip Register 55 */
#define MTU_MC34_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CEu)

/** \brief 22D0, Read Data and Bit Flip Register 56 */
#define MTU_MC34_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D0u)

/** \brief 22D2, Read Data and Bit Flip Register 57 */
#define MTU_MC34_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D2u)

/** \brief 22D4, Read Data and Bit Flip Register 58 */
#define MTU_MC34_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D4u)

/** \brief 22D6, Read Data and Bit Flip Register 59 */
#define MTU_MC34_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D6u)

/** \brief 22D8, Read Data and Bit Flip Register 60 */
#define MTU_MC34_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D8u)

/** \brief 22DA, Read Data and Bit Flip Register 61 */
#define MTU_MC34_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DAu)

/** \brief 22DC, Read Data and Bit Flip Register 62 */
#define MTU_MC34_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DCu)

/** \brief 22DE, Read Data and Bit Flip Register 63 */
#define MTU_MC34_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DEu)

/** \brief 22E0, Read Data and Bit Flip Register 64 */
#define MTU_MC34_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E0u)

/** \brief 22E2, Read Data and Bit Flip Register 65 */
#define MTU_MC34_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E2u)

/** \brief 22E4, Read Data and Bit Flip Register 66 */
#define MTU_MC34_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E4u)

/** \brief 22EE, Alarm Sources Configuration Register */
#define MTU_MC34_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00632EEu)

/** \brief 22F0, SSH Safety Faults Status Register  */
#define MTU_MC34_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00632F0u)

/** \brief 22F2, Error Information Register 0 */
#define MTU_MC34_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F2u)

/** \brief 22F4, Error Information Register 1 */
#define MTU_MC34_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F4u)

/** \brief 22F6, Error Information Register 2 */
#define MTU_MC34_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F6u)

/** \brief 22F8, Error Information Register 3 */
#define MTU_MC34_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F8u)

/** \brief 22FA, Error Information Register 4 */
#define MTU_MC34_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632FAu)

/** \brief 2300, Configuration Registers */
#define MTU_MC35_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063300u)

/** \brief 2302, Configuration Register 1 */
#define MTU_MC35_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063302u)

/** \brief 2304, MBIST Control Register */
#define MTU_MC35_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063304u)

/** \brief 2306, Status Register */
#define MTU_MC35_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063306u)

/** \brief 2308, Range Register, single address mode */
#define MTU_MC35_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063308u)

/** \brief 230C, Revision ID Register */
#define MTU_MC35_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006330Cu)

/** \brief 230E, ECC Safety Register */
#define MTU_MC35_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006330Eu)

/** \brief 2310, Memory ECC Detection Register */
#define MTU_MC35_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063310u)

/** \brief 2312, Error Tracking Register 0 */
#define MTU_MC35_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063312u)

