dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 2B66, Read Data and Bit Flip Register 3 */
#define MTU_MC43_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B66u)

/** \brief 2B68, Read Data and Bit Flip Register 4 */
#define MTU_MC43_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B68u)

/** \brief 2B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC43_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Au)

/** \brief 2B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC43_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Cu)

/** \brief 2B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC43_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Eu)

/** \brief 2B70, Read Data and Bit Flip Register 8 */
#define MTU_MC43_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B70u)

/** \brief 2B72, Read Data and Bit Flip Register 9 */
#define MTU_MC43_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B72u)

/** \brief 2B74, Read Data and Bit Flip Register 10 */
#define MTU_MC43_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B74u)

/** \brief 2B76, Read Data and Bit Flip Register 11 */
#define MTU_MC43_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B76u)

/** \brief 2B78, Read Data and Bit Flip Register 12 */
#define MTU_MC43_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B78u)

/** \brief 2B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC43_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Au)

/** \brief 2B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC43_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Cu)

/** \brief 2B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC43_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Eu)

/** \brief 2B80, Read Data and Bit Flip Register 16 */
#define MTU_MC43_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B80u)

/** \brief 2B82, Read Data and Bit Flip Register 17 */
#define MTU_MC43_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B82u)

/** \brief 2B84, Read Data and Bit Flip Register 18 */
#define MTU_MC43_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B84u)

/** \brief 2B86, Read Data and Bit Flip Register 19 */
#define MTU_MC43_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B86u)

/** \brief 2B88, Read Data and Bit Flip Register 20 */
#define MTU_MC43_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B88u)

/** \brief 2B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC43_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Au)

/** \brief 2B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC43_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Cu)

/** \brief 2B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC43_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Eu)

/** \brief 2B90, Read Data and Bit Flip Register 24 */
#define MTU_MC43_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B90u)

/** \brief 2B92, Read Data and Bit Flip Register 25 */
#define MTU_MC43_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B92u)

/** \brief 2B94, Read Data and Bit Flip Register 26 */
#define MTU_MC43_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B94u)

/** \brief 2B96, Read Data and Bit Flip Register 27 */
#define MTU_MC43_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B96u)

/** \brief 2B98, Read Data and Bit Flip Register 28 */
#define MTU_MC43_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B98u)

/** \brief 2B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC43_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Au)

/** \brief 2B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC43_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Cu)

/** \brief 2B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC43_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Eu)

/** \brief 2BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC43_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA0u)

/** \brief 2BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC43_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA2u)

/** \brief 2BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC43_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA4u)

/** \brief 2BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC43_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA6u)

/** \brief 2BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC43_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA8u)

/** \brief 2BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC43_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BAAu)

/** \brief 2BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC43_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BACu)

/** \brief 2BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC43_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BAEu)

/** \brief 2BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC43_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB0u)

/** \brief 2BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC43_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB2u)

/** \brief 2BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC43_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB4u)

/** \brief 2BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC43_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB6u)

/** \brief 2BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC43_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB8u)

/** \brief 2BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC43_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBAu)

/** \brief 2BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC43_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBCu)

/** \brief 2BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC43_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBEu)

/** \brief 2BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC43_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC0u)

/** \brief 2BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC43_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC2u)

/** \brief 2BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC43_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC4u)

/** \brief 2BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC43_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC6u)

/** \brief 2BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC43_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC8u)

/** \brief 2BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC43_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCAu)

