dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 2FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC47_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC6u)

/** \brief 2FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC47_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC8u)

/** \brief 2FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC47_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCAu)

/** \brief 2FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC47_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCCu)

/** \brief 2FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC47_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCEu)

/** \brief 2FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC47_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD0u)

/** \brief 2FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC47_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD2u)

/** \brief 2FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC47_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD4u)

/** \brief 2FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC47_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD6u)

/** \brief 2FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC47_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD8u)

/** \brief 2FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC47_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDAu)

/** \brief 2FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC47_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDCu)

/** \brief 2FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC47_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDEu)

/** \brief 2FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC47_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE0u)

/** \brief 2FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC47_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE2u)

/** \brief 2FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC47_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE4u)

/** \brief 2FEE, Alarm Sources Configuration Register */
#define MTU_MC47_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063FEEu)

/** \brief 2FF0, SSH Safety Faults Status Register  */
#define MTU_MC47_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063FF0u)

/** \brief 2FF2, Error Information Register 0 */
#define MTU_MC47_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF2u)

/** \brief 2FF4, Error Information Register 1 */
#define MTU_MC47_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF4u)

/** \brief 2FF6, Error Information Register 2 */
#define MTU_MC47_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF6u)

/** \brief 2FF8, Error Information Register 3 */
#define MTU_MC47_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF8u)

/** \brief 2FFA, Error Information Register 4 */
#define MTU_MC47_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FFAu)

/** \brief 3000, Configuration Registers */
#define MTU_MC48_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064000u)

/** \brief 3002, Configuration Register 1 */
#define MTU_MC48_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064002u)

/** \brief 3004, MBIST Control Register */
#define MTU_MC48_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064004u)

/** \brief 3006, Status Register */
#define MTU_MC48_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064006u)

/** \brief 3008, Range Register, single address mode */
#define MTU_MC48_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064008u)

/** \brief 300C, Revision ID Register */
#define MTU_MC48_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006400Cu)

/** \brief 300E, ECC Safety Register */
#define MTU_MC48_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006400Eu)

/** \brief 3010, Memory ECC Detection Register */
#define MTU_MC48_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064010u)

/** \brief 3012, Error Tracking Register 0 */
#define MTU_MC48_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064012u)

/** \brief 3014, Error Tracking Register 1 */
#define MTU_MC48_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064014u)

/** \brief 3016, Error Tracking Register 2 */
#define MTU_MC48_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064016u)

/** \brief 3018, Error Tracking Register 3 */
#define MTU_MC48_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064018u)

/** \brief 301A, Error Tracking Register 4 */
#define MTU_MC48_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006401Au)

/** \brief 3060, Read Data and Bit Flip Register 0 */
#define MTU_MC48_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064060u)

/** \brief 3062, Read Data and Bit Flip Register 1 */
#define MTU_MC48_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064062u)

/** \brief 3064, Read Data and Bit Flip Register 2 */
#define MTU_MC48_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064064u)

/** \brief 3066, Read Data and Bit Flip Register 3 */
#define MTU_MC48_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064066u)

/** \brief 3068, Read Data and Bit Flip Register 4 */
#define MTU_MC48_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064068u)

/** \brief 306A, Read Data and Bit Flip Register 5 */
#define MTU_MC48_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Au)

