dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 368E, Read Data and Bit Flip Register 23 */
#define MTU_MC54_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Eu)

/** \brief 3690, Read Data and Bit Flip Register 24 */
#define MTU_MC54_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064690u)

/** \brief 3692, Read Data and Bit Flip Register 25 */
#define MTU_MC54_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064692u)

/** \brief 3694, Read Data and Bit Flip Register 26 */
#define MTU_MC54_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064694u)

/** \brief 3696, Read Data and Bit Flip Register 27 */
#define MTU_MC54_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064696u)

/** \brief 3698, Read Data and Bit Flip Register 28 */
#define MTU_MC54_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064698u)

/** \brief 369A, Read Data and Bit Flip Register 29 */
#define MTU_MC54_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Au)

/** \brief 369C, Read Data and Bit Flip Register 30 */
#define MTU_MC54_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Cu)

/** \brief 369E, Read Data and Bit Flip Register 31 */
#define MTU_MC54_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Eu)

/** \brief 36A0, Read Data and Bit Flip Register 32 */
#define MTU_MC54_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A0u)

/** \brief 36A2, Read Data and Bit Flip Register 33 */
#define MTU_MC54_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A2u)

/** \brief 36A4, Read Data and Bit Flip Register 34 */
#define MTU_MC54_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A4u)

/** \brief 36A6, Read Data and Bit Flip Register 35 */
#define MTU_MC54_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A6u)

/** \brief 36A8, Read Data and Bit Flip Register 36 */
#define MTU_MC54_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A8u)

/** \brief 36AA, Read Data and Bit Flip Register 37 */
#define MTU_MC54_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646AAu)

/** \brief 36AC, Read Data and Bit Flip Register 38 */
#define MTU_MC54_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646ACu)

/** \brief 36AE, Read Data and Bit Flip Register 39 */
#define MTU_MC54_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646AEu)

/** \brief 36B0, Read Data and Bit Flip Register 40 */
#define MTU_MC54_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B0u)

/** \brief 36B2, Read Data and Bit Flip Register 41 */
#define MTU_MC54_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B2u)

/** \brief 36B4, Read Data and Bit Flip Register 42 */
#define MTU_MC54_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B4u)

/** \brief 36B6, Read Data and Bit Flip Register 43 */
#define MTU_MC54_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B6u)

/** \brief 36B8, Read Data and Bit Flip Register 44 */
#define MTU_MC54_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B8u)

/** \brief 36BA, Read Data and Bit Flip Register 45 */
#define MTU_MC54_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BAu)

/** \brief 36BC, Read Data and Bit Flip Register 46 */
#define MTU_MC54_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BCu)

/** \brief 36BE, Read Data and Bit Flip Register 47 */
#define MTU_MC54_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BEu)

/** \brief 36C0, Read Data and Bit Flip Register 48 */
#define MTU_MC54_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C0u)

/** \brief 36C2, Read Data and Bit Flip Register 49 */
#define MTU_MC54_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C2u)

/** \brief 36C4, Read Data and Bit Flip Register 50 */
#define MTU_MC54_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C4u)

/** \brief 36C6, Read Data and Bit Flip Register 51 */
#define MTU_MC54_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C6u)

/** \brief 36C8, Read Data and Bit Flip Register 52 */
#define MTU_MC54_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C8u)

/** \brief 36CA, Read Data and Bit Flip Register 53 */
#define MTU_MC54_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CAu)

/** \brief 36CC, Read Data and Bit Flip Register 54 */
#define MTU_MC54_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CCu)

/** \brief 36CE, Read Data and Bit Flip Register 55 */
#define MTU_MC54_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CEu)

/** \brief 36D0, Read Data and Bit Flip Register 56 */
#define MTU_MC54_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D0u)

/** \brief 36D2, Read Data and Bit Flip Register 57 */
#define MTU_MC54_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D2u)

/** \brief 36D4, Read Data and Bit Flip Register 58 */
#define MTU_MC54_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D4u)

/** \brief 36D6, Read Data and Bit Flip Register 59 */
#define MTU_MC54_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D6u)

/** \brief 36D8, Read Data and Bit Flip Register 60 */
#define MTU_MC54_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D8u)

/** \brief 36DA, Read Data and Bit Flip Register 61 */
#define MTU_MC54_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DAu)

/** \brief 36DC, Read Data and Bit Flip Register 62 */
#define MTU_MC54_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DCu)

/** \brief 36DE, Read Data and Bit Flip Register 63 */
#define MTU_MC54_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DEu)

/** \brief 36E0, Read Data and Bit Flip Register 64 */
#define MTU_MC54_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E0u)

