dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 36E2, Read Data and Bit Flip Register 65 */
#define MTU_MC54_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E2u)

/** \brief 36E4, Read Data and Bit Flip Register 66 */
#define MTU_MC54_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E4u)

/** \brief 36EE, Alarm Sources Configuration Register */
#define MTU_MC54_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00646EEu)

/** \brief 36F0, SSH Safety Faults Status Register  */
#define MTU_MC54_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00646F0u)

/** \brief 36F2, Error Information Register 0 */
#define MTU_MC54_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F2u)

/** \brief 36F4, Error Information Register 1 */
#define MTU_MC54_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F4u)

/** \brief 36F6, Error Information Register 2 */
#define MTU_MC54_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F6u)

/** \brief 36F8, Error Information Register 3 */
#define MTU_MC54_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F8u)

/** \brief 36FA, Error Information Register 4 */
#define MTU_MC54_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646FAu)

/** \brief 3700, Configuration Registers */
#define MTU_MC55_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064700u)

/** \brief 3702, Configuration Register 1 */
#define MTU_MC55_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064702u)

/** \brief 3704, MBIST Control Register */
#define MTU_MC55_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064704u)

/** \brief 3706, Status Register */
#define MTU_MC55_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064706u)

/** \brief 3708, Range Register, single address mode */
#define MTU_MC55_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064708u)

/** \brief 370C, Revision ID Register */
#define MTU_MC55_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006470Cu)

/** \brief 370E, ECC Safety Register */
#define MTU_MC55_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006470Eu)

/** \brief 3710, Memory ECC Detection Register */
#define MTU_MC55_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064710u)

/** \brief 3712, Error Tracking Register 0 */
#define MTU_MC55_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064712u)

/** \brief 3714, Error Tracking Register 1 */
#define MTU_MC55_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064714u)

/** \brief 3716, Error Tracking Register 2 */
#define MTU_MC55_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064716u)

/** \brief 3718, Error Tracking Register 3 */
#define MTU_MC55_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064718u)

/** \brief 371A, Error Tracking Register 4 */
#define MTU_MC55_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006471Au)

/** \brief 3760, Read Data and Bit Flip Register 0 */
#define MTU_MC55_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064760u)

/** \brief 3762, Read Data and Bit Flip Register 1 */
#define MTU_MC55_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064762u)

/** \brief 3764, Read Data and Bit Flip Register 2 */
#define MTU_MC55_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064764u)

/** \brief 3766, Read Data and Bit Flip Register 3 */
#define MTU_MC55_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064766u)

/** \brief 3768, Read Data and Bit Flip Register 4 */
#define MTU_MC55_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064768u)

/** \brief 376A, Read Data and Bit Flip Register 5 */
#define MTU_MC55_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Au)

/** \brief 376C, Read Data and Bit Flip Register 6 */
#define MTU_MC55_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Cu)

/** \brief 376E, Read Data and Bit Flip Register 7 */
#define MTU_MC55_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Eu)

/** \brief 3770, Read Data and Bit Flip Register 8 */
#define MTU_MC55_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064770u)

/** \brief 3772, Read Data and Bit Flip Register 9 */
#define MTU_MC55_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064772u)

/** \brief 3774, Read Data and Bit Flip Register 10 */
#define MTU_MC55_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064774u)

/** \brief 3776, Read Data and Bit Flip Register 11 */
#define MTU_MC55_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064776u)

/** \brief 3778, Read Data and Bit Flip Register 12 */
#define MTU_MC55_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064778u)

/** \brief 377A, Read Data and Bit Flip Register 13 */
#define MTU_MC55_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Au)

/** \brief 377C, Read Data and Bit Flip Register 14 */
#define MTU_MC55_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Cu)

/** \brief 377E, Read Data and Bit Flip Register 15 */
#define MTU_MC55_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Eu)

/** \brief 3780, Read Data and Bit Flip Register 16 */
#define MTU_MC55_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064780u)

/** \brief 3782, Read Data and Bit Flip Register 17 */
#define MTU_MC55_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064782u)

/** \brief 3784, Read Data and Bit Flip Register 18 */
#define MTU_MC55_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064784u)

/** \brief 3786, Read Data and Bit Flip Register 19 */
#define MTU_MC55_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064786u)

/** \brief 3788, Read Data and Bit Flip Register 20 */
#define MTU_MC55_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064788u)

/** \brief 378A, Read Data and Bit Flip Register 21 */
#define MTU_MC55_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Au)

/** \brief 378C, Read Data and Bit Flip Register 22 */
#define MTU_MC55_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Cu)

/** \brief 378E, Read Data and Bit Flip Register 23 */
#define MTU_MC55_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Eu)

/** \brief 3790, Read Data and Bit Flip Register 24 */
#define MTU_MC55_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064790u)

/** \brief 3792, Read Data and Bit Flip Register 25 */
#define MTU_MC55_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064792u)

/** \brief 3794, Read Data and Bit Flip Register 26 */
#define MTU_MC55_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064794u)

/** \brief 3796, Read Data and Bit Flip Register 27 */
#define MTU_MC55_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064796u)

