dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 4B04, MBIST Control Register */
#define MTU_MC75_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065B04u)

/** \brief 4B06, Status Register */
#define MTU_MC75_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065B06u)

/** \brief 4B08, Range Register, single address mode */
#define MTU_MC75_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065B08u)

/** \brief 4B0C, Revision ID Register */
#define MTU_MC75_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065B0Cu)

/** \brief 4B0E, ECC Safety Register */
#define MTU_MC75_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065B0Eu)

/** \brief 4B10, Memory ECC Detection Register */
#define MTU_MC75_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065B10u)

/** \brief 4B12, Error Tracking Register 0 */
#define MTU_MC75_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B12u)

/** \brief 4B14, Error Tracking Register 1 */
#define MTU_MC75_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B14u)

/** \brief 4B16, Error Tracking Register 2 */
#define MTU_MC75_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B16u)

/** \brief 4B18, Error Tracking Register 3 */
#define MTU_MC75_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B18u)

/** \brief 4B1A, Error Tracking Register 4 */
#define MTU_MC75_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B1Au)

/** \brief 4B60, Read Data and Bit Flip Register 0 */
#define MTU_MC75_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B60u)

/** \brief 4B62, Read Data and Bit Flip Register 1 */
#define MTU_MC75_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B62u)

/** \brief 4B64, Read Data and Bit Flip Register 2 */
#define MTU_MC75_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B64u)

/** \brief 4B66, Read Data and Bit Flip Register 3 */
#define MTU_MC75_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B66u)

/** \brief 4B68, Read Data and Bit Flip Register 4 */
#define MTU_MC75_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B68u)

/** \brief 4B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC75_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Au)

/** \brief 4B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC75_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Cu)

/** \brief 4B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC75_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Eu)

/** \brief 4B70, Read Data and Bit Flip Register 8 */
#define MTU_MC75_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B70u)

/** \brief 4B72, Read Data and Bit Flip Register 9 */
#define MTU_MC75_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B72u)

/** \brief 4B74, Read Data and Bit Flip Register 10 */
#define MTU_MC75_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B74u)

/** \brief 4B76, Read Data and Bit Flip Register 11 */
#define MTU_MC75_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B76u)

/** \brief 4B78, Read Data and Bit Flip Register 12 */
#define MTU_MC75_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B78u)

/** \brief 4B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC75_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Au)

/** \brief 4B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC75_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Cu)

/** \brief 4B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC75_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Eu)

/** \brief 4B80, Read Data and Bit Flip Register 16 */
#define MTU_MC75_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B80u)

/** \brief 4B82, Read Data and Bit Flip Register 17 */
#define MTU_MC75_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B82u)

/** \brief 4B84, Read Data and Bit Flip Register 18 */
#define MTU_MC75_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B84u)

/** \brief 4B86, Read Data and Bit Flip Register 19 */
#define MTU_MC75_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B86u)

/** \brief 4B88, Read Data and Bit Flip Register 20 */
#define MTU_MC75_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B88u)

/** \brief 4B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC75_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Au)

/** \brief 4B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC75_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Cu)

/** \brief 4B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC75_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Eu)

/** \brief 4B90, Read Data and Bit Flip Register 24 */
#define MTU_MC75_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B90u)

/** \brief 4B92, Read Data and Bit Flip Register 25 */
#define MTU_MC75_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B92u)

/** \brief 4B94, Read Data and Bit Flip Register 26 */
#define MTU_MC75_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B94u)

/** \brief 4B96, Read Data and Bit Flip Register 27 */
#define MTU_MC75_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B96u)

/** \brief 4B98, Read Data and Bit Flip Register 28 */
#define MTU_MC75_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B98u)

/** \brief 4B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC75_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Au)

/** \brief 4B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC75_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Cu)

/** \brief 4B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC75_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Eu)

/** \brief 4BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC75_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA0u)

/** \brief 4BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC75_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA2u)

/** \brief 4BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC75_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA4u)

