dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_reg.h
/** \brief 52BC, Read Data and Bit Flip Register 46 */
#define MTU_MC82_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BCu)

/** \brief 52BE, Read Data and Bit Flip Register 47 */
#define MTU_MC82_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BEu)

/** \brief 52C0, Read Data and Bit Flip Register 48 */
#define MTU_MC82_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C0u)

/** \brief 52C2, Read Data and Bit Flip Register 49 */
#define MTU_MC82_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C2u)

/** \brief 52C4, Read Data and Bit Flip Register 50 */
#define MTU_MC82_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C4u)

/** \brief 52C6, Read Data and Bit Flip Register 51 */
#define MTU_MC82_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C6u)

/** \brief 52C8, Read Data and Bit Flip Register 52 */
#define MTU_MC82_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C8u)

/** \brief 52CA, Read Data and Bit Flip Register 53 */
#define MTU_MC82_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CAu)

/** \brief 52CC, Read Data and Bit Flip Register 54 */
#define MTU_MC82_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CCu)

/** \brief 52CE, Read Data and Bit Flip Register 55 */
#define MTU_MC82_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CEu)

/** \brief 52D0, Read Data and Bit Flip Register 56 */
#define MTU_MC82_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D0u)

/** \brief 52D2, Read Data and Bit Flip Register 57 */
#define MTU_MC82_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D2u)

/** \brief 52D4, Read Data and Bit Flip Register 58 */
#define MTU_MC82_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D4u)

/** \brief 52D6, Read Data and Bit Flip Register 59 */
#define MTU_MC82_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D6u)

/** \brief 52D8, Read Data and Bit Flip Register 60 */
#define MTU_MC82_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D8u)

/** \brief 52DA, Read Data and Bit Flip Register 61 */
#define MTU_MC82_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DAu)

/** \brief 52DC, Read Data and Bit Flip Register 62 */
#define MTU_MC82_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DCu)

/** \brief 52DE, Read Data and Bit Flip Register 63 */
#define MTU_MC82_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DEu)

/** \brief 52E0, Read Data and Bit Flip Register 64 */
#define MTU_MC82_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E0u)

/** \brief 52E2, Read Data and Bit Flip Register 65 */
#define MTU_MC82_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E2u)

/** \brief 52E4, Read Data and Bit Flip Register 66 */
#define MTU_MC82_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E4u)

/** \brief 52EE, Alarm Sources Configuration Register */
#define MTU_MC82_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00662EEu)

/** \brief 52F0, SSH Safety Faults Status Register  */
#define MTU_MC82_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00662F0u)

/** \brief 52F2, Error Information Register 0 */
#define MTU_MC82_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F2u)

/** \brief 52F4, Error Information Register 1 */
#define MTU_MC82_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F4u)

/** \brief 52F6, Error Information Register 2 */
#define MTU_MC82_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F6u)

/** \brief 52F8, Error Information Register 3 */
#define MTU_MC82_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F8u)

/** \brief 52FA, Error Information Register 4 */
#define MTU_MC82_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662FAu)

/** \brief 5300, Configuration Registers */
#define MTU_MC83_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066300u)

/** \brief 5302, Configuration Register 1 */
#define MTU_MC83_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066302u)

/** \brief 5304, MBIST Control Register */
#define MTU_MC83_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066304u)

/** \brief 5306, Status Register */
#define MTU_MC83_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066306u)

/** \brief 5308, Range Register, single address mode */
#define MTU_MC83_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066308u)

/** \brief 530C, Revision ID Register */
#define MTU_MC83_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006630Cu)

/** \brief 530E, ECC Safety Register */
#define MTU_MC83_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006630Eu)

/** \brief 5310, Memory ECC Detection Register */
#define MTU_MC83_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066310u)

/** \brief 5312, Error Tracking Register 0 */
#define MTU_MC83_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066312u)

/** \brief 5314, Error Tracking Register 1 */
#define MTU_MC83_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066314u)

/** \brief 5316, Error Tracking Register 2 */
#define MTU_MC83_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066316u)

/** \brief 5318, Error Tracking Register 3 */
#define MTU_MC83_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066318u)

/** \brief 531A, Error Tracking Register 4 */
#define MTU_MC83_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006631Au)

/** \brief 5360, Read Data and Bit Flip Register 0 */
#define MTU_MC83_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066360u)

/** \brief 5362, Read Data and Bit Flip Register 1 */
#define MTU_MC83_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066362u)

/** \brief 5364, Read Data and Bit Flip Register 2 */
#define MTU_MC83_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066364u)

